Revit 2024 API
AssemblyMemberDifferentCategory.CategoryId2 Property
 Category id of the second assembly member
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public ElementId CategoryId2 { get; }
Visual Basic
Public ReadOnly Property CategoryId2 As ElementId
	Get
Visual C++
public:
property ElementId^ CategoryId2 {
	ElementId^ get ();
}
See Also
AssemblyMemberDifferentCategory Class
Autodesk.Revit.DB Namespace